src/cf/InformationRegisters/РеквизитыУплатыНалоговИПлатежейВБюджет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РеквизитыУплатыНалоговИПлатежейВБюджет</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетПолучателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидПеречисленияВБюджет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПеречисленийВБюджет</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусСоставителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоказательОснования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОчередностьПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоказательПериода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьПоказательТипа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидПлатежа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНалоговИПлатежейВБюджет</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РегистрацияВНалоговомОргане</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПоказательТипа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.УчетПоПодразделениям</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеКорректироватьСтоимостьАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

src/cf/Catalogs/РегистрацииВНалоговомОргане.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>РегистрацииВНалоговомОргане</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Доверенность</Name>
					<Comment>Доверенность налогоплательщика на представителя</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоверенностиНалогоплательщика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПредставителя</Name>
					<Comment>Название документа, подтверждающего полномочия представителя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКТМО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКАТО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Comment>Код причины постановки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеИФНС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеОбособленногоПодразделения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Представитель</Name>
					<Comment>Представитель в территориальном органе ФНС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДоверенность</Name>
					<Comment>Доверенность налогоплательщика на представителя</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоверенностиНалогоплательщика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УполномоченноеЛицоПредставителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/ВидыНалоговИПлатежейВБюджет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ВидыНалоговИПлатежейВБюджет</Name>
			<Comment>Налоги, взносы и иные платежи в бюджет</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидНалога</Name>
					<Comment>Заполняется для поставляемых данных</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНалогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодБК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаКодБыстрогоВыбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>210</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАктуальности</Name>
					<Comment>Служебный реквизит</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/РеквизитыУплатыНалоговИПлатежейВБюджет/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция НайтиПоКБК(Организация, КБК, КодТерритории) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",   Организация);
	Запрос.УстановитьПараметр("КБК",           КБК); // Настройка может быть выполнена так, что надо искать по части КБК - без символов 14-17 (см. заполнение реквизитов в клиент-банке). Но мы этим пренебрежем для простоты. Все равно настройка настолько непонятная, что вряд ли с ней кто-то справится.
	Запрос.УстановитьПараметр("КодТерритории", КодТерритории);
	
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 2
	|	Реквизиты.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	Реквизиты.ВидПлатежа КАК ВидПлатежа,
	|	Реквизиты.Организация,
	|	Реквизиты.ПоказательТипа,
	|	1 КАК Приоритет
	|ПОМЕСТИТЬ ПодходящиеКлючи
	|ИЗ
	|	РегистрСведений.РеквизитыУплатыНалоговИПлатежейВБюджет КАК Реквизиты
	|ГДЕ
	|	Реквизиты.ВидПлатежа.КодБК = &КБК
	|	И Реквизиты.Организация = &Организация
	|	И (Реквизиты.РегистрацияВНалоговомОргане.КодПоОКАТО = &КодТерритории
	|			ИЛИ Реквизиты.РегистрацияВНалоговомОргане.КодПоОКТМО = &КодТерритории)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 2
	|	Реквизиты.РегистрацияВНалоговомОргане,
	|	Реквизиты.ВидПлатежа,
	|	Реквизиты.Организация,
	|	Реквизиты.ПоказательТипа,
	|	2
	|ИЗ
	|	РегистрСведений.РеквизитыУплатыНалоговИПлатежейВБюджет КАК Реквизиты
	|ГДЕ
	|	Реквизиты.ВидПлатежа.КодБК = &КБК
	|	И Реквизиты.Организация = &Организация
	|	И Реквизиты.РегистрацияВНалоговомОргане = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 2
	|	Реквизиты.РегистрацияВНалоговомОргане,
	|	Реквизиты.ВидПлатежа,
	|	Реквизиты.Организация,
	|	Реквизиты.ПоказательТипа,
	|	3
	|ИЗ
	|	РегистрСведений.РеквизитыУплатыНалоговИПлатежейВБюджет КАК Реквизиты
	|ГДЕ
	|	Реквизиты.ВидПлатежа.КодБК = &КБК
	|	И Реквизиты.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|	И Реквизиты.РегистрацияВНалоговомОргане = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Приоритет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(ПодходящиеКлючи.Приоритет) КАК Приоритет
	|ПОМЕСТИТЬ МинимальныйПриоритет
	|ИЗ
	|	ПодходящиеКлючи КАК ПодходящиеКлючи
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Приоритет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Реквизиты.ПоказательТипа,
	|	Реквизиты.ВидПлатежа.СчетУчета КАК СчетУчета,
	|	Реквизиты.Получатель,
	|	Реквизиты.СчетПолучателя,
	|	Реквизиты.ВидПеречисленияВБюджет,
	|	Реквизиты.СтатусСоставителя,
	|	Реквизиты.ОчередностьПлатежа,
	|	Реквизиты.СтатьяДвиженияДенежныхСредств,
	|	Реквизиты.НазначениеПлатежа,
	|	Реквизиты.ПоказательОснования,
	|	Реквизиты.ПоказательПериода
	|ИЗ
	|	ПодходящиеКлючи КАК ПодходящиеКлючи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МинимальныйПриоритет КАК МинимальныйПриоритет
	|		ПО ПодходящиеКлючи.Приоритет = МинимальныйПриоритет.Приоритет
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыУплатыНалоговИПлатежейВБюджет КАК Реквизиты
	|		ПО ПодходящиеКлючи.РегистрацияВНалоговомОргане = Реквизиты.РегистрацияВНалоговомОргане
	|			И ПодходящиеКлючи.ВидПлатежа = Реквизиты.ВидПлатежа
	|			И ПодходящиеКлючи.Организация = Реквизиты.Организация
	|			И ПодходящиеКлючи.ПоказательТипа = Реквизиты.ПоказательТипа";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		
		Выборка = Результат.Выбрать();
		Если Выборка.Количество() <> 1 Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Реквизиты = Новый Структура;
		Реквизиты.Вставить("СчетУчета");
		Реквизиты.Вставить("ВидПеречисленияВБюджет");
		Реквизиты.Вставить("ПоказательТипа");
		Реквизиты.Вставить("Получатель");
		Реквизиты.Вставить("СчетПолучателя");
		Реквизиты.Вставить("СтатусСоставителя");
		Реквизиты.Вставить("ОчередностьПлатежа");
		Реквизиты.Вставить("НазначениеПлатежа");
		Реквизиты.Вставить("СтатьяДвиженияДенежныхСредств");
		Реквизиты.Вставить("ПоказательОснования");
		Реквизиты.Вставить("ПоказательПериода");
		
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(Реквизиты, Выборка);
		
		Возврат Реквизиты;
		
	КонецЕсли;
	
КонецФункции

Функция ДанныеЗаполнения(КлючЗаписи, Период) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",                 КлючЗаписи.Организация);
	Запрос.УстановитьПараметр("РегистрацияВНалоговомОргане", КлючЗаписи.РегистрацияВНалоговомОргане);
	Запрос.УстановитьПараметр("ВидПлатежа",                  КлючЗаписи.ВидПлатежа);
	Запрос.УстановитьПараметр("ПоказательТипа",              КлючЗаписи.ПоказательТипа);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Настройка.ВидПлатежа КАК Налог,
	|	Настройка.ВидПлатежа.ВидНалога КАК ВидНалога,
	|	Настройка.ВидПлатежа.КодБК КАК КодБК,
	|	Настройка.ВидПлатежа.СчетУчета КАК СчетУчета,
	|	Настройка.Организация КАК Организация,
	|	Настройка.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	Настройка.РегистрацияВНалоговомОргане.КПП КАК КПП,
	|	Настройка.ПоказательТипа КАК ПоказательТипа,
	|	Настройка.Получатель КАК Контрагент,
	|	Настройка.Получатель.ИНН КАК ИННПолучателя,
	|	Настройка.Получатель.КПП КАК КПППолучателя,
	|	Настройка.СчетПолучателя КАК СчетКонтрагента,
	|	Настройка.ВидПеречисленияВБюджет КАК ВидПеречисленияВБюджет,
	|	Настройка.СтатусСоставителя КАК СтатусСоставителя,
	|	Настройка.ПоказательОснования КАК ПоказательОснования,
	|	Настройка.ОчередностьПлатежа КАК ОчередностьПлатежа,
	|	Настройка.НазначениеПлатежа КАК НазначениеПлатежа,
	|	Настройка.ПоказательПериода КАК ПоказательПериода,
	|	Настройка.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств
	|ИЗ
	|	РегистрСведений.РеквизитыУплатыНалоговИПлатежейВБюджет КАК Настройка
	|ГДЕ
	|	Настройка.ВидПлатежа = &ВидПлатежа
	|	И Настройка.Организация = &Организация
	|	И Настройка.РегистрацияВНалоговомОргане = &РегистрацияВНалоговомОргане
	|	И Настройка.ПоказательТипа = &ПоказательТипа";
	
	Настройка = Запрос.Выполнить().Выбрать();
	Если НЕ Настройка.Следующий() Тогда
		Возврат Новый Структура;
	КонецЕсли;
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Налог");
	ДанныеЗаполнения.Вставить("КодБК");
	ДанныеЗаполнения.Вставить("СчетУчета");
	ДанныеЗаполнения.Вставить("РегистрацияВНалоговомОргане");
	ДанныеЗаполнения.Вставить("ПоказательТипа");
	
	ДанныеЗаполнения.Вставить("Контрагент");
	ДанныеЗаполнения.Вставить("ИННПолучателя");
	ДанныеЗаполнения.Вставить("КПППолучателя");
	ДанныеЗаполнения.Вставить("СчетКонтрагента");
	
	ДанныеЗаполнения.Вставить("ВидПеречисленияВБюджет");
	ДанныеЗаполнения.Вставить("СтатусСоставителя");
	ДанныеЗаполнения.Вставить("ПоказательОснования");
	
	ДанныеЗаполнения.Вставить("ОчередностьПлатежа");
	ДанныеЗаполнения.Вставить("НазначениеПлатежа");
	
	ДанныеЗаполнения.Вставить("СтатьяДвиженияДенежныхСредств");
	
	ЗаполнитьЗначенияСвойств(ДанныеЗаполнения, Настройка);
	
	Если ЗначениеЗаполнено(Настройка.РегистрацияВНалоговомОргане) Тогда
		
		КодТерритории = Справочники.РегистрацииВНалоговомОргане.КодТерритории(
			Настройка.РегистрацияВНалоговомОргане,
			ОбщегоНазначенияБП.ПолучитьРабочуюДату());
		
		Если ЗначениеЗаполнено(КодТерритории) Тогда
			ДанныеЗаполнения.Вставить("КодОКАТО", КодТерритории);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Настройка.КПП) Тогда
			ДанныеЗаполнения.Вставить("КПП", Настройка.КПП);
		КонецЕсли;
		
	КонецЕсли;
	
	Если Настройка.ВидПеречисленияВБюджет = Перечисления.ВидыПеречисленийВБюджет.НалоговыйПлатеж Тогда
		
		Если ЗначениеЗаполнено(Настройка.ВидНалога) Тогда
			// Указан поставляемый вид налога. Получаем значения КБК и счета учета с проверкой актуальности.
			ДанныеЗаполнения.Вставить("КодБК", 
				Справочники.ВидыНалоговИПлатежейВБюджет.КБК(Настройка.Налог, , Период));
			ДанныеЗаполнения.Вставить("СчетУчета", 
				Справочники.ВидыНалоговИПлатежейВБюджет.СчетУчета(Настройка.Налог, Период));
		КонецЕсли;
		
		НалоговыйПериод = ПлатежиВБюджетКлиентСервер.НалоговыйПериод(Период, Настройка.ПоказательПериода);
		ДанныеЗаполнения.Вставить("ПоказательПериода", НалоговыйПериод);
		
		НазначениеПлатежа = Настройка.НазначениеПлатежа;
		
		Если ПустаяСтрока(НазначениеПлатежа) Тогда
			// Автоназначение платежа
			НазначениеПлатежа=  Справочники.ВидыНалоговИПлатежейВБюджет.НазначениеПлатежа(
				Настройка.Налог, , Настройка.Организация, Период);
		Иначе
			// Пользовательское назначение платежа
			ПредставлениеНалоговогоПериода = ПлатежиВБюджетКлиентСервер.ПредставлениеНалоговогоПериода(НалоговыйПериод);
			
			Если Не ПустаяСтрока(ПредставлениеНалоговогоПериода) Тогда
				НазначениеПлатежа = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = '%1 %2'"), НазначениеПлатежа, ПредставлениеНалоговогоПериода);
			КонецЕсли;
			
		КонецЕсли;
		
		ДанныеЗаполнения.Вставить("НазначениеПлатежа", НазначениеПлатежа);
		
	КонецЕсли;
	
	// Сумма платежа
	
	Если ЗначениеЗаполнено(Настройка.СчетУчета)
		И (БухгалтерскийУчетВызовСервераПовтИсп.СчетВИерархии(Настройка.СчетУчета, ПланыСчетов.Хозрасчетный.РасчетыПоНалогам)
		Или БухгалтерскийУчетВызовСервераПовтИсп.СчетВИерархии(Настройка.СчетУчета, ПланыСчетов.Хозрасчетный.РасчетыПоСоциальномуСтрахованию)) Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Организация", Настройка.Организация);
		Запрос.УстановитьПараметр("СчетУчета",   Настройка.СчетУчета);
		
		ШаблонТекстаЗапроса =
		"ВЫБРАТЬ
		|	СУММА(ХозрасчетныйОстатки.СуммаОстатокКт) КАК Сумма
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(
		|			,
		|			Счет = &СчетУчета,
		|			[ВидыСубконто],
		|			Организация = &Организация
		|				[Условия]) КАК ХозрасчетныйОстатки";
		
		Аналитика = РасчетыСБюджетом.АналитикаНаСчетеРасчетовСБюджетом(
			Настройка.СчетУчета,
			Настройка.Организация,
			Настройка.РегистрацияВНалоговомОргане,
			Неопределено,
			Настройка.КодБК,
			Настройка.ПоказательОснования,
			Настройка.ПоказательТипа,
			Ложь); // Оборотные субконто исключаем
			
		ПараметрыТекста = Новый Структура;
		Если Аналитика.Количество() = 0 Тогда
			ПараметрыТекста.Вставить("ВидыСубконто", "");
			ПараметрыТекста.Вставить("Условия",      "");
		Иначе
			
			ПараметрыТекста.Вставить("ВидыСубконто", "&ВидыСубконто");
			Запрос.УстановитьПараметр("ВидыСубконто", Аналитика.ВыгрузитьКолонку("ВидСубконто"));
			
			УсловияНаСубконто = "";
			Для Индекс = 0 По Аналитика.Количество() - 1 Цикл
				ИмяСубконто = "Субконто" + (Индекс + 1);
				Запрос.УстановитьПараметр(ИмяСубконто, Аналитика[Индекс].Значение);
				УсловияНаСубконто = УсловияНаСубконто + " И " + ИмяСубконто + " = &" + ИмяСубконто;
			КонецЦикла;
			
			ПараметрыТекста.Вставить("Условия", УсловияНаСубконто);
			
		КонецЕсли;
		
		Запрос.Текст = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(ШаблонТекстаЗапроса, ПараметрыТекста);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() И Выборка.Сумма > 0 Тогда
			ДанныеЗаполнения.Вставить("СуммаДокумента", Выборка.Сумма);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ДанныеЗаполнения;
	
КонецФункции

Функция ПолучитьНастройкуРеквизитыПлатежаВБюджет(УчетныеДанные, Организация, РегистрацияВНалоговомОргане) Экспорт
	
	ОбъединительЗапросов = "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|";
	ТекстыЗапросов = Новый Массив;
	Если ЗначениеЗаполнено(РегистрацияВНалоговомОргане) Тогда
		ТекстыЗапросов.Добавить("ВЫБРАТЬ
		|	1 КАК Приоритет,
		|	СписокРеквизитов.ВидПлатежа КАК ВидПлатежа,
		|	СписокРеквизитов.Организация КАК Организация,
		|	СписокРеквизитов.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
		|	СписокРеквизитов.ПоказательТипа КАК ПоказательТипа
		|ИЗ
		|	РегистрСведений.РеквизитыУплатыНалоговИПлатежейВБюджет КАК СписокРеквизитов
		|ГДЕ
		|	СписокРеквизитов.ВидПлатежа.СчетУчета = &СчетУчета
		|	И СписокРеквизитов.Организация = &Организация
		|	И СписокРеквизитов.РегистрацияВНалоговомОргане = &РегистрацияВНалоговомОргане");
	КонецЕсли;
	
	ТекстыЗапросов.Добавить("
	|ВЫБРАТЬ
	|	2 КАК Приоритет,
	|	СписокРеквизитов.ВидПлатежа КАК ВидПлатежа,
	|	СписокРеквизитов.Организация КАК Организация,
	|	СписокРеквизитов.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	СписокРеквизитов.ПоказательТипа КАК ПоказательТипа
	|ИЗ
	|	РегистрСведений.РеквизитыУплатыНалоговИПлатежейВБюджет КАК СписокРеквизитов
	|ГДЕ
	|	СписокРеквизитов.ВидПлатежа.СчетУчета = &СчетУчета
	|	И СписокРеквизитов.Организация = &Организация
	|	И СписокРеквизитов.РегистрацияВНалоговомОргане = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)");
	
	ТекстыЗапросов.Добавить("
	|ВЫБРАТЬ
	|	3 КАК Приоритет,
	|	СписокРеквизитов.ВидПлатежа КАК ВидПлатежа,
	|	СписокРеквизитов.Организация КАК Организация,
	|	СписокРеквизитов.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	СписокРеквизитов.ПоказательТипа КАК ПоказательТипа
	|ИЗ
	|	РегистрСведений.РеквизитыУплатыНалоговИПлатежейВБюджет КАК СписокРеквизитов
	|ГДЕ
	|	СписокРеквизитов.ВидПлатежа.СчетУчета = &СчетУчета
	|	И СписокРеквизитов.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|	И СписокРеквизитов.РегистрацияВНалоговомОргане = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)");
	
	ТекстЗапроса = СтроковыеФункцииКлиентСервер.СтрокаИзМассиваПодстрок(ТекстыЗапросов, ОбъединительЗапросов);
	
	Запрос = Новый Запрос;
	
	НомерСубконтоУровниБюджета = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НомерСубконто(
		УчетныеДанные.СчетУчета,
		ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.УровниБюджетов);
	Если НомерСубконтоУровниБюджета > 0 Тогда
		РасположениеЭлементаКБК = ПлатежиВБюджетКлиентСервер.РасположениеЭлементаКБК("КодЭлементаДоходов");
		Если РасположениеЭлементаКБК <> Неопределено Тогда
			Запрос.УстановитьПараметр("КодыЭлементаДохода", ПлатежиВБюджет.КодыЭлементаДоходаПоУровнюБюджета(
				УчетныеДанные["Субконто" + НомерСубконтоУровниБюджета]));
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
				"СписокРеквизитов.ВидПлатежа.СчетУчета = &СчетУчета",
				"СписокРеквизитов.ВидПлатежа.СчетУчета = &СчетУчета
				|	И ПОДСТРОКА(СписокРеквизитов.ВидПлатежа.КодБК, "
				+ РасположениеЭлементаКБК.Начало
				+ ", " + РасположениеЭлементаКБК.Длина + ") В(&КодыЭлементаДохода)");
		КонецЕсли;
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + "
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет ВОЗР";
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("СчетУчета",   УчетныеДанные.СчетУчета);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("РегистрацияВНалоговомОргане", РегистрацияВНалоговомОргане);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат КлючЗаписиРеквизитыПлатежаВБюджет(Выборка);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Возвращает реквизиты для уплаты налога
//
// Параметры:
//  Налог                       - СправочникСсылка.ВидыНалоговИПлатежейВБюджет
//  Организация                 - СправочникСсылка.Организации
//  РегистрацияВНалоговомОргане - СправочникСсылка.РегистрацииВНалоговомОргане
//
// Возвращаемое значение:
//  Структура - элементы структуры соответствуют ресурсам регистра РеквизитыУплатыНалоговИПлатежейВБюджет
//
Функция КлючНастройкиУплатыНалога(Налог, Организация, РегистрацияВНалоговомОргане) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидПлатежа",                  Налог);
	Запрос.УстановитьПараметр("Организация",                 Организация);
	Запрос.УстановитьПараметр("РегистрацияВНалоговомОргане", РегистрацияВНалоговомОргане);
	
	ТекстЗапроса = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	1 КАК Приоритет,
		|	РеквизитыУплатыНалоговИПлатежейВБюджет.ВидПлатежа,
		|	РеквизитыУплатыНалоговИПлатежейВБюджет.Организация,
		|	РеквизитыУплатыНалоговИПлатежейВБюджет.РегистрацияВНалоговомОргане,
		|	РеквизитыУплатыНалоговИПлатежейВБюджет.ПоказательТипа
		|ИЗ
		|	РегистрСведений.РеквизитыУплатыНалоговИПлатежейВБюджет КАК РеквизитыУплатыНалоговИПлатежейВБюджет
		|ГДЕ
		|	РеквизитыУплатыНалоговИПлатежейВБюджет.ВидПлатежа = &ВидПлатежа
		|	И РеквизитыУплатыНалоговИПлатежейВБюджет.Организация = &Организация
		|	И &УсловиеПоРегистрацииВНалоговомОргане";
	
	Если НалоговыйУчетОбособленныхПодразделений.УчетВРазрезеНалоговыхОрганов() Тогда
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоРегистрацииВНалоговомОргане",
			"РеквизитыУплатыНалоговИПлатежейВБюджет.РегистрацияВНалоговомОргане = &РегистрацияВНалоговомОргане");
		
		ТекстЗапроса = ТекстЗапроса + 
			"
			|ОБЪЕДИНИТЬ ВСЕ
			|" + 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	2 КАК Приоритет,
			|	РеквизитыУплатыНалоговИПлатежейВБюджет.ВидПлатежа,
			|	РеквизитыУплатыНалоговИПлатежейВБюджет.Организация,
			|	РеквизитыУплатыНалоговИПлатежейВБюджет.РегистрацияВНалоговомОргане,
			|	РеквизитыУплатыНалоговИПлатежейВБюджет.ПоказательТипа
			|ИЗ
			|	РегистрСведений.РеквизитыУплатыНалоговИПлатежейВБюджет КАК РеквизитыУплатыНалоговИПлатежейВБюджет
			|ГДЕ
			|	РеквизитыУплатыНалоговИПлатежейВБюджет.ВидПлатежа = &ВидПлатежа
			|	И РеквизитыУплатыНалоговИПлатежейВБюджет.Организация = &Организация
			|	И РеквизитыУплатыНалоговИПлатежейВБюджет.РегистрацияВНалоговомОргане = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)";
		
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоРегистрацииВНалоговомОргане", "ИСТИНА");
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + 
		"
		|ОБЪЕДИНИТЬ ВСЕ
		|" + 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	3 КАК Приоритет,
		|	РеквизитыУплатыНалоговИПлатежейВБюджет.ВидПлатежа,
		|	РеквизитыУплатыНалоговИПлатежейВБюджет.Организация,
		|	РеквизитыУплатыНалоговИПлатежейВБюджет.РегистрацияВНалоговомОргане,
		|	РеквизитыУплатыНалоговИПлатежейВБюджет.ПоказательТипа
		|ИЗ
		|	РегистрСведений.РеквизитыУплатыНалоговИПлатежейВБюджет КАК РеквизитыУплатыНалоговИПлатежейВБюджет
		|ГДЕ
		|	РеквизитыУплатыНалоговИПлатежейВБюджет.ВидПлатежа = &ВидПлатежа
		|	И РеквизитыУплатыНалоговИПлатежейВБюджет.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет";
	
	Запрос.Текст = ТекстЗапроса;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = КлючЗаписиРеквизитыПлатежаВБюджет(Выборка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция КлючЗаписиРеквизитыПлатежаВБюджет(Выборка)
	
	ЗначениеКлюча = Новый Структура;
	ЗначениеКлюча.Вставить("ВидПлатежа");
	ЗначениеКлюча.Вставить("Организация");
	ЗначениеКлюча.Вставить("РегистрацияВНалоговомОргане");
	ЗначениеКлюча.Вставить("ПоказательТипа");
	
	ЗаполнитьЗначенияСвойств(ЗначениеКлюча, Выборка);
	
	ПараметрыКонструктора = Новый Массив;
	ПараметрыКонструктора.Добавить(ЗначениеКлюча);
	
	Возврат Новый(Тип("РегистрСведенийКлючЗаписи.РеквизитыУплатыНалоговИПлатежейВБюджет"), ПараметрыКонструктора);
	
КонецФункции

#КонецОбласти

#КонецЕсли
